In [2]:
import pandas as pd

df = pd.read_csv("customers.csv")
df.head()

,customer_id,age,gender,geography,tenure,balance,num_of_products,has_credit_card,is_active_member,estimated_salary,churn
0,15634602,42,Female,France,8,0.00,1,1,1,101348.88,1
1,15647311,41,Female,Spain,1,83807.86,1,0,1,112542.58,0
2,15619304,42,Female,France,3,159660.80,3,1,0,113931.57,1
3,15574012,39,Female,France,1,0.00,2,0,0,93826.63,0
4,15592531,43,Male,Germany,2,125510.82,1,1,1,79084.10,0

In [3]:
df['churn'].value_counts()

churn
1    5
0    5
Name: count, dtype: int64

In [4]:
churn_rate = df['churn'].mean() * 100
print("Churn Rate: ", churn_rate, "%")

Churn Rate:  50.0 %

In [5]:
summary = df.groupby('geography')['churn'].mean().reset_index()
summary['churn'] = summary['churn'] * 100
summary.to_csv("churn_summary_by_country.csv", index=False)
summary

  geography      churn
0    France  80.000000
1   Germany   0.000000
2     Spain  33.333333